# MajorOverhangFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..MajorOverhangFailure Property
BuiltInFailures..::..FabricFailures Class See Also
---
At least one of the overhangs in the major direction is lower than radius of the wire in the minor direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MajorOverhangFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MajorOverhangFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MajorOverhangFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace